STMicroelectronics/STM32CubeH7/Projects/NUCLEO-H723ZG/Examples_LL/COMP/COMP_CompareGpioVsVrefInt_IT_Init/STM32CubeIDE/Example/Startup/startup_stm32h723zgtx.s
   .weak      SDMMC1_IRQHandler            
   .thumb_set SDMMC1_IRQHandler,Default_Handler
                     
   .weak      TIM5_IRQHandler            
   .thumb_set TIM5_IRQHandler,Default_Handler
                     
   .weak      SPI3_IRQHandler            
   .thumb_set SPI3_IRQHandler,Default_Handler
                     
   .weak      UART4_IRQHandler         
   .thumb_set UART4_IRQHandler,Default_Handler
                  
   .weak      UART5_IRQHandler         
   .thumb_set UART5_IRQHandler,Default_Handler
                  
   .weak      TIM6_DAC_IRQHandler                  
   .thumb_set TIM6_DAC_IRQHandler,Default_Handler
               
   .weak      TIM7_IRQHandler            
   .thumb_set TIM7_IRQHandler,Default_Handler
         
   .weak      DMA2_Stream0_IRQHandler               
   .thumb_set DMA2_Stream0_IRQHandler,Default_Handler
               
   .weak      DMA2_Stream1_IRQHandler               
   .thumb_set DMA2_Stream1_IRQHandler,Default_Handler
                  
   .weak      DMA2_Stream2_IRQHandler               
   .thumb_set DMA2_Stream2_IRQHandler,Default_Handler
            
   .weak      DMA2_Stream3_IRQHandler               
   .thumb_set DMA2_Stream3_IRQHandler,Default_Handler
            
   .weak      DMA2_Stream4_IRQHandler               
   .thumb_set DMA2_Stream4_IRQHandler,Default_Handler
    
   .weak      ETH_IRQHandler   
   .thumb_set ETH_IRQHandler,Default_Handler
   
   .weak      ETH_WKUP_IRQHandler   
   .thumb_set ETH_WKUP_IRQHandler,Default_Handler

   .weak      FDCAN_CAL_IRQHandler   
   .thumb_set FDCAN_CAL_IRQHandler,Default_Handler   
                                                                  
   .weak      DMA2_Stream5_IRQHandler               
   .thumb_set DMA2_Stream5_IRQHandler,Default_Handler
                  
   .weak      DMA2_Stream6_IRQHandler               
   .thumb_set DMA2_Stream6_IRQHandler,Default_Handler
                  
   .weak      DMA2_Stream7_IRQHandler               
   .thumb_set DMA2_Stream7_IRQHandler,Default_Handler
                  
   .weak      USART6_IRQHandler      
   .thumb_set USART6_IRQHandler,Default_Handler
                        
   .weak      I2C3_EV_IRQHandler   
   .thumb_set I2C3_EV_IRQHandler,Default_Handler
                        
   .weak      I2C3_ER_IRQHandler   
   .thumb_set I2C3_ER_IRQHandler,Default_Handler
                        
   .weak      OTG_HS_EP1_OUT_IRQHandler         
   .thumb_set OTG_HS_EP1_OUT_IRQHandler,Default_Handler
               
   .weak      OTG_HS_EP1_IN_IRQHandler            
   .thumb_set OTG_HS_EP1_IN_IRQHandler,Default_Handler
               
   .weak      OTG_HS_WKUP_IRQHandler         
   .thumb_set OTG_HS_WKUP_IRQHandler,Default_Handler
            
   .weak      OTG_HS_IRQHandler      
   .thumb_set OTG_HS_IRQHandler,Default_Handler
                  
   .weak      DCMI_PSSI_IRQHandler            
   .thumb_set DCMI_PSSI_IRQHandler,Default_Handler

   .weak      RNG_IRQHandler            
   .thumb_set RNG_IRQHandler,Default_Handler   

   .weak      FPU_IRQHandler                  
   .thumb_set FPU_IRQHandler,Default_Handler

   .weak      UART7_IRQHandler                  
   .thumb_set UART7_IRQHandler,Default_Handler

   .weak      UART8_IRQHandler                  
   .thumb_set UART8_IRQHandler,Default_Handler   

   .weak      SPI4_IRQHandler            
   .thumb_set SPI4_IRQHandler,Default_Handler
   
   .weak      SPI5_IRQHandler            
   .thumb_set SPI5_IRQHandler,Default_Handler

   .weak      SPI6_IRQHandler            
   .thumb_set SPI6_IRQHandler,Default_Handler   

   .weak      SAI1_IRQHandler            
   .thumb_set SAI1_IRQHandler,Default_Handler
   
   .weak      LTDC_IRQHandler            
   .thumb_set LTDC_IRQHandler,Default_Handler

   .weak      LTDC_ER_IRQHandler            
   .thumb_set LTDC_ER_IRQHandler,Default_Handler

   .weak      DMA2D_IRQHandler            
   .thumb_set DMA2D_IRQHandler,Default_Handler
   
   .weak      OCTOSPI1_IRQHandler            
   .thumb_set OCTOSPI1_IRQHandler,Default_Handler
 
   .weak      LPTIM1_IRQHandler            
   .thumb_set LPTIM1_IRQHandler,Default_Handler

   .weak      CEC_IRQHandler            
   .thumb_set CEC_IRQHandler,Default_Handler
   
   .weak      I2C4_EV_IRQHandler            
   .thumb_set I2C4_EV_IRQHandler,Default_Handler 
 
   .weak      I2C4_ER_IRQHandler            
   .thumb_set I2C4_ER_IRQHandler,Default_Handler
   
   .weak      SPDIF_RX_IRQHandler            
   .thumb_set SPDIF_RX_IRQHandler,Default_Handler
   
   .weak      DMAMUX1_OVR_IRQHandler            
   .thumb_set DMAMUX1_OVR_IRQHandler,Default_Handler

   .weak      DFSDM1_FLT0_IRQHandler            
   .thumb_set DFSDM1_FLT0_IRQHandler,Default_Handler   

   .weak      DFSDM1_FLT1_IRQHandler            
   .thumb_set DFSDM1_FLT1_IRQHandler,Default_Handler 

   .weak      DFSDM1_FLT2_IRQHandler            
   .thumb_set DFSDM1_FLT2_IRQHandler,Default_Handler 

   .weak      DFSDM1_FLT3_IRQHandler            
   .thumb_set DFSDM1_FLT3_IRQHandler,Default_Handler
   
   .weak      SWPMI1_IRQHandler            
   .thumb_set SWPMI1_IRQHandler,Default_Handler

   .weak      TIM15_IRQHandler            
   .thumb_set TIM15_IRQHandler,Default_Handler 

   .weak      TIM16_IRQHandler            
   .thumb_set TIM16_IRQHandler,Default_Handler 

   .weak      TIM17_IRQHandler            
   .thumb_set TIM17_IRQHandler,Default_Handler 

   .weak      MDIOS_WKUP_IRQHandler            
   .thumb_set MDIOS_WKUP_IRQHandler,Default_Handler 

   .weak      MDIOS_IRQHandler            
   .thumb_set MDIOS_IRQHandler,Default_Handler

   .weak      MDMA_IRQHandler            
   .thumb_set MDMA_IRQHandler,Default_Handler 

   .weak      SDMMC2_IRQHandler            
   .thumb_set SDMMC2_IRQHandler,Default_Handler 
   
   .weak      HSEM1_IRQHandler            
   .thumb_set HSEM1_IRQHandler,Default_Handler

   .weak      ADC3_IRQHandler            
   .thumb_set ADC3_IRQHandler,Default_Handler 

   .weak      DMAMUX2_OVR_IRQHandler            
   .thumb_set DMAMUX2_OVR_IRQHandler,Default_Handler 

   .weak      BDMA_Channel0_IRQHandler            
   .thumb_set BDMA_Channel0_IRQHandler,Default_Handler 

