STMicroelectronics/STM32CubeH7/Projects/NUCLEO-H723ZG/Examples_LL/COMP/COMP_CompareGpioVsVrefInt_IT_Init/STM32CubeIDE/Example/Startup/startup_stm32h723zgtx.s
   .weak      BDMA_Channel1_IRQHandler            
   .thumb_set BDMA_Channel1_IRQHandler,Default_Handler 

   .weak      BDMA_Channel2_IRQHandler            
   .thumb_set BDMA_Channel2_IRQHandler,Default_Handler 

   .weak      BDMA_Channel3_IRQHandler            
   .thumb_set BDMA_Channel3_IRQHandler,Default_Handler 

   .weak      BDMA_Channel4_IRQHandler            
   .thumb_set BDMA_Channel4_IRQHandler,Default_Handler 

   .weak      BDMA_Channel5_IRQHandler            
   .thumb_set BDMA_Channel5_IRQHandler,Default_Handler    

   .weak      BDMA_Channel6_IRQHandler            
   .thumb_set BDMA_Channel6_IRQHandler,Default_Handler

   .weak      BDMA_Channel7_IRQHandler            
   .thumb_set BDMA_Channel7_IRQHandler,Default_Handler 

   .weak      COMP1_IRQHandler            
   .thumb_set COMP1_IRQHandler,Default_Handler 

   .weak      LPTIM2_IRQHandler            
   .thumb_set LPTIM2_IRQHandler,Default_Handler 

   .weak      LPTIM3_IRQHandler            
   .thumb_set LPTIM3_IRQHandler,Default_Handler 

   .weak      LPTIM4_IRQHandler            
   .thumb_set LPTIM4_IRQHandler,Default_Handler 

   .weak      LPTIM5_IRQHandler            
   .thumb_set LPTIM5_IRQHandler,Default_Handler 

   .weak      LPUART1_IRQHandler            
   .thumb_set LPUART1_IRQHandler,Default_Handler 

   .weak      CRS_IRQHandler            
   .thumb_set CRS_IRQHandler,Default_Handler 

   .weak      ECC_IRQHandler            
   .thumb_set ECC_IRQHandler,Default_Handler

   .weak      SAI4_IRQHandler            
   .thumb_set SAI4_IRQHandler,Default_Handler

   .weak      DTS_IRQHandler            
   .thumb_set DTS_IRQHandler,Default_Handler    

   .weak      WAKEUP_PIN_IRQHandler            
   .thumb_set WAKEUP_PIN_IRQHandler,Default_Handler

   .weak      OCTOSPI2_IRQHandler            
   .thumb_set OCTOSPI2_IRQHandler,Default_Handler

   .weak      FMAC_IRQHandler            
   .thumb_set FMAC_IRQHandler,Default_Handler

   .weak      CORDIC_IRQHandler            
   .thumb_set CORDIC_IRQHandler,Default_Handler

   .weak      UART9_IRQHandler            
   .thumb_set UART9_IRQHandler,Default_Handler

   .weak      USART10_IRQHandler            
   .thumb_set USART10_IRQHandler,Default_Handler

   .weak      I2C5_EV_IRQHandler            
   .thumb_set I2C5_EV_IRQHandler,Default_Handler

   .weak      I2C5_ER_IRQHandler            
   .thumb_set I2C5_ER_IRQHandler,Default_Handler

   .weak      FDCAN3_IT0_IRQHandler            
   .thumb_set FDCAN3_IT0_IRQHandler,Default_Handler

   .weak      FDCAN3_IT1_IRQHandler            
   .thumb_set FDCAN3_IT1_IRQHandler,Default_Handler

   .weak      TIM23_IRQHandler            
   .thumb_set TIM23_IRQHandler,Default_Handler

   .weak      TIM24_IRQHandler            
   .thumb_set TIM24_IRQHandler,Default_Handler    
   
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/        
 
